СЦ_Мобильное/src/Documents/СборИнформацииОбОтправлении/СборИнформацииОбОтправлении.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>СборИнформацииОбОтправлении</name>
  <posting>Deny</posting>
  <attributes>
    <name>КоличествоЗаказов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Отправления</name>
    <attributes>
      <name>Отправление</name>
      <type>
        <types>CatalogRef.Отправления</types>
      </type>
    </attributes>
    <attributes>
      <name>СтатусОтправления</name>
      <type>
        <types>CatalogRef.СтатусыОтправлений</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаУстановкиСтатуса</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Штрихкод</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

СЦ_Мобильное/src/Catalogs/Отправления/Отправления.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Отправления</name>
  <attributes>
    <name>СлужбаДоставки</name>
    <type>
      <types>CatalogRef.СлужбыДоставки</types>
    </type>
  </attributes>
  <attributes>
    <name>ИнтернетМагазин</name>
    <type>
      <types>CatalogRef.ИнтернетМагазины</types>
    </type>
  </attributes>
  <attributes>
    <name>СкладВозврата</name>
    <type>
      <types>CatalogRef.СкладыВозврата</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерСД</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Вес</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Дата</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерСЦ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

СЦ_Мобильное/src/Documents/СборИнформацииОбОтправлении/Forms/ФормаДокумента/Module.bsl
&НаКлиенте
Процедура СканированиеАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	Если Найти(текст,Символы.ПС)>0 И СокрЛП(Текст) <> "" Тогда
		СчитатьШтрихкод(СтрЗаменить(Текст, Символы.ПС, ""));
		ТекущийЭлемент = Элементы.Сканирование;
		Сканирование = "";
	КонецЕсли;
КонецПроцедуры

Процедура СчитатьШтрихкод(ШК)
	Зап = Новый Запрос;
	Зап.Текст = "ВЫБРАТЬ
	            |	Отправления.Ссылка КАК Заказ,
	            |	Отправления.СлужбаДоставки,
	            |	Отправления.ИнтернетМагазин,
	            |	Отправления.СкладВозврата,
	            |	Отправления.НомерСД,
	            |	Отправления.Код КАК НомерЯндекс
	            |ИЗ
	            |	Справочник.Отправления КАК Отправления
	            |ГДЕ
	            |	Отправления.Код = &ШК";
	Зап.УстановитьПараметр("ШК", ШК);
	Рез = Зап.Выполнить().Выгрузить();
	Если Рез.Количество() <> 0 Тогда
		Нов = Объект.Отправления.Добавить();
		Нов.Отправление = Рез[0].Заказ;
		Нов.Штрихкод = ШК;
		
		СлужбаДоставки = Рез[0].СлужбаДоставки;
		ИнтернетМагазин = Рез[0].ИнтернетМагазин;
		СкладВозврата = Рез[0].СкладВозврата;
		НомерЗаказа = Рез[0].НомерЯндекс;
		Элементы.Сканирование.ЦветФона = WebЦвета.ЖелтоЗеленый;
	Иначе
		Нов = Объект.Отправления.Добавить();
		Нов.Штрихкод = ШК;		
		Элементы.Сканирование.ЦветФона = WebЦвета.Лосось;
	КонецеСли;
КонецПроцедуры
